Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Inspecting with profile ''{0}''
zh_cn: 使用配置文件 ''{0}'' 检查

source: Inspection
zh_cn: 检查

source: Inspection ''{0}'' has no configurable options
zh_cn: 检查 ''{0}'' 没有可配置的选项

source: Inspection ''{0}'' is disabled: ID ''{1}'' not matches ''{2}'' pattern.
zh_cn: 检查 ''{0}'' 被禁用:ID ''{1}'' 不匹配 ''{2}'' 模式。

source: Inspection ''{0}'' is disabled: {1}.
zh_cn: 检查 ''{0}'' 是禁用:{1}。

source: Inspection ''{0}'' options
zh_cn: 检查 ''{0}'' 选项

source: Inspection Results Export
zh_cn: 检验结果导出

source: Inspection Tool Window
zh_cn: 检查工具窗口

source: Inspection cannot proceed.
zh_cn: 检查无法进行。

source: Inspection disabled
zh_cn: 检查禁用

source: Inspection options
zh_cn: 检查选项

source: Inspection profile
zh_cn: 检查配置文件

source: Inspection profile with name ''{0}'' already exists.
zh_cn: 具有名称 ''{0}'' 的检查配置文件已经存在。

source: Inspection profile: {0} {1, choice, 0#(inactive)|1#}
zh_cn: 检查配置文件: {0} {1, choice, 0#(inactive·)|1#}

source: Inspection profiles
zh_cn: 检查配置文件

source: Inspection scope is invalid.
zh_cn: 检查范围无效。

source: Inspection {0} options
zh_cn: 检查 {0} 选项

source: Inspections
zh_cn: 检查

source: Install or update {0} plugins ?
zh_cn: 安装或更新 {0} 插件 ?

source: Installed
zh_cn: 已安装

source: Instance
zh_cn: 实例

source: Instance 2 Schema generator error
zh_cn: 实例到 Schema 生成器错误

source: Instance Filters
zh_cn: 实例过滤器

source: Instance ID should be a numeric value of type 'long'
zh_cn: 实例 ID 应该是 'long' 类型的数值

source: Instance To Schema
zh_cn: 实例到 Schema

source: Instance document file does not exist
zh_cn: 实例文档文件不存在

source: Instance document file name to be generated
zh_cn: 要生成的实例文档文件名

source: Instance document name:
zh_cn: 实例文档名称:

source: Instance document path:
zh_cn: 实例文档路径:

source: Instance fields
zh_cn: 实例字段

source: Instance filters:
zh_cn: 实例过滤器:

source: Instance method ''{0}'' in ''{1}'' cannot override static method ''{2}'' in ''{3}''
zh_cn: ''{1}'' 中的实例方法 ''{0}'' 不能覆盖 ''{3}'' 中的静态方法 ''{2}''

source: Instance methods
zh_cn: 实例方法

source: Instance to Schema Generator Error
zh_cn: 实例到 Schema 生成器错误

source: Instances casted to java.lang.Object
zh_cn: 实例转换为 java.lang.Object

source: Instances of {0} upcasted to {1} were found.
zh_cn: 找到 {0} 的实例向上转为 {1} 。

source: Instances upcasted to Object
zh_cn: 实例向上转为 Object

source: Instances upcasted to java.lang.Object found
zh_cn: 找到实例向上转换为 java.lang.Object

source: Instantiated from
zh_cn: 实例化

source: Instantiated {0, choice, 1#1 instantiation|2#{0, number} instantiations} found in the project code.
zh_cn: 项目代码中找到 {0, choice, 1#1 个|2#{0, number} 个} 实例化实例。

source: Instantiating tests...
zh_cn: 实例化测试...

source: Instead, press &shortcut:EditorScrollUp; and &shortcut:EditorScrollDown; to scroll through the history of commands.
zh_cn: 只需要按 &shortcut:EditorScrollUp; 和 &shortcut:EditorScrollDown; 来浏览命令历史记录。

source: Instead, you can use the familiar code completion &shortcut:CodeCompletion;.
zh_cn: 只需使用熟悉的代码补全 &shortcut:CodeCompletion; 。

source: Instrumenting agent (requires debugger restart)
zh_cn: Instrumenting agent(需要调试器启动)

source: Inte_grate
zh_cn: 整合(_G)

source: Inte_grate Project
zh_cn: 整合项目(_G)

source: Inte_grate {0}
zh_cn: 整合 {0}(_G)

source: Integer number too large
zh_cn: 整数太大

source: Integer value expected
zh_cn: 预期整型值

source: Integrate
zh_cn: 整合

source: Integrate project
zh_cn: 整合项目

source: Integrate selected files or directories
zh_cn: 整合选中文件或目录

source: Integrate {0}
zh_cn: 整合 {0}

source: IntelliJ IDEA has analyzed which of its features you are using and has found some that you have probably missed.
zh_cn: &productName; 分析了你正使用的一些功能，并查找你可能错过的功能。

source: Intention List
zh_cn: 意向列表

source: Intentions
zh_cn: 意向

source: Interceptor Bindings
zh_cn: 拦截器绑定

source: Interface
zh_cn: 接口

source: Interface abstract methods cannot have body
zh_cn: 接口抽象方法不能有方法体

source: Interface expected here
zh_cn: 这里期望接口

source: Interface is not allowed
zh_cn: 接口是不允许的

source: Interface methods cannot have body
zh_cn: 接口方法不能有方法体

source: Interface not allowed here
zh_cn: 这里不允许接口

source: Interface {0} does not have base interfaces
zh_cn: 接口 {0} 没有基本接口

source: Interface {0} does not have inheritors
zh_cn: 接口 {0} 没有继承者

source: Interface {0} has been successfully created
zh_cn: 已成功创建接口 {0}

source: Internal error
zh_cn: 内部错误

source: Internal error loading debug information from ''{0}''.
zh_cn: 从 ''{0}'' 加载调试信息发生内部错误。

source: Internal exception - invalid stackframe
zh_cn: 内部异常 - 无效的堆栈桢

source: Internationalization
zh_cn: 国际化

source: Internationalization issues
zh_cn: 国际化问题

source: Internet Explorer
zh_cn: IE 浏览器

source: Interrupt
zh_cn: 中断

source: Intersection of {0} and {1}
zh_cn: {0} 和 {1} 的交叉点

source: Intersection types in casts
zh_cn: 转换时的交叉类型

source: Introduce Constant Across the Project
zh_cn: 跨项目引入常量

source: Introduce Parameter Object
zh_cn: 引入参数对象

source: Introduce Variable refactoring
zh_cn: 引入变量重构

source: Introduce constant across the project
zh_cn: 跨项目引入常量

source: Introduce local variable
zh_cn: 引入局部变量

source: Introduced parameter class {0} for {1}()
zh_cn: 为 {1}() 引入了参数类 {0}

source: Introduced variable will conflict with {0}
zh_cn: 引入的变量将与 {0} 冲突

source: Introducing variable may break code logic
zh_cn: 引入变量可能打破代码逻辑

source: Invalid
zh_cn: 无效

source: Invalid Data
zh_cn: 无效数据

source: Invalid File
zh_cn: 无效文件

source: Invalid File Template for Catch Body!
zh_cn: Catch Body 无效的文件模板

source: Invalid Groovy Script
zh_cn: 无效的 Groovy 脚本

source: Invalid Input
zh_cn: 无效的输入

source: Invalid JDK home directory specified.{0}
zh_cn: 指定的 JDK 主目录无效。{0}

source: Invalid License Data
zh_cn: 无效的许可证数据

source: Invalid Regular Expression
zh_cn: 无效的正则表达式

source: Invalid URL
zh_cn: 无效的 URL

source: Invalid URL: {0}
zh_cn: 无效的 URL: {0}

source: Invalid array size
zh_cn: 无效的数组大小

source: Invalid container annotation ''{0}'': ''value'' method should have type ''{1}''
zh_cn: 无效的容器注解 ''{0}'':''value'' 方法应该有类型 ''{1}''

source: Invalid container annotation ''{0}'': no ''value'' method declared
zh_cn: 无效的容器注解 ''{0}'': 没有 ''value'' 方法申明

source: Invalid declaration : {0} Only local variable declarations are supported.
zh_cn: 无效声明:{0} 只支持局部变量声明。

source: Invalid directory name: ''{0}''
zh_cn: 无效的目录名称：''{0}''

source: Invalid directory.
zh_cn: 无效的目录。

source: Invalid expression : {0}
zh_cn: 无效表达式：{0}

source: Invalid expression context.
zh_cn: 无效的表达式上下文。

source: Invalid expression for array dimension: {0}
zh_cn: 对于数组维度: {0} 是无效的表达式

source: Invalid field name ''{0}''
zh_cn: 无效字段名 ''{0}''

source: Invalid file
zh_cn: 无效文件

source: Invalid file name: ''{0}''
zh_cn: 无效的文件名：''{0}''

source: Invalid id reference
zh_cn: 无效的 id 引用

source: Invalid index expression
zh_cn: 无效的索引表达式

source: Invalid library name
zh_cn: 无效的库名

source: Invalid license data.
zh_cn: 无效的许可证数据。

source: Invalid local variable name ''{0}''
zh_cn: 无效的局部变量名 ''{0}''

source: Invalid method declaration; return type required
zh_cn: 方法声明无效;需要返回类型

source: Invalid modifier type {0}
zh_cn: 无效的修饰符类型 {0}

source: Invalid number
zh_cn: 无效数字

source: Invalid occurrence count
zh_cn: 无效的匹配项次数

source: Invalid or corrupted module file ''{0}'': {1}
zh_cn: 模块文件 ''{0}'' 无效或损坏： {1}

source: Invalid property key
zh_cn: 无效属性健

source: Invalid qualified new
zh_cn: 无效的 qualified new

source: Invalid regular expression
zh_cn: 无效的正则表达式

source: Invalid regular expression {0}
zh_cn: 无效的正则表达式 {0}

source: Invalid regular expression: {0}
zh_cn: 无效的正则表达式：{0}

source: Invalid resource bundle reference ''{0}''
zh_cn: 无效的资源包引用 ''{0}''

source: Invalid statement
zh_cn: 无效的语句

source: Invalid string escape
zh_cn: 无效字符串转义

source: Invalid tags
zh_cn: 无效标签

source: Invalid target package name specified
zh_cn: 指定的目标包名称无效

source: Invalid template file name or extension
zh_cn: 模板文件名或扩展名无效

source: Invalid type ''{0}'' for annotation member
zh_cn: 注解成员的类型 ''{0}'' 无效

source: Invalid type name ''{0}''
zh_cn: 无效的类名 ''{0}''

source: Invalid type name: ''{0}''
zh_cn: 无效类名：''{0}''

source: Invalid value: ''{0}''
zh_cn: 无效的值:''{0}''

source: Invalidate Caches / Restart...
zh_cn: 使缓存无效/重启...

source: Invert 'if' condition
zh_cn: 反转 'if' 条件

source: Invert Boolean
zh_cn: 反转布尔值

source: Invert _Boolean...
zh_cn: 反转布尔值...(_B)

source: Invert condition
zh_cn: 反转条件

source: Invert {0} {1} and its usages
zh_cn: 反转 {0} {1} 及其用法

source: Invisible keymap group parent
zh_cn: 不可见的快捷键组父项

source: Invocations to be inlined {0}
zh_cn: 要内联 {0} 的调用

source: Invoke the live template that bound to 'Custom shortcut' with the prefix typed in the editor
zh_cn: 使用编辑器中键入的前缀调用绑定到 '自定义快捷方式' 的代码模板

source: Is Active
zh_cn: 是激活的

source: Is empty:\&nbsp;true
zh_cn: 是否为空:\&nbsp;true

source: Is implemented by<br>
zh_cn: 已由<br> 实现

source: Is implemented in <br>
zh_cn: 已实现于<br>

source: Is overridden in <br>
zh_cn: 已覆盖于<br>

source: Is overridden in subclasses
zh_cn: 在子类中被覆盖

source: Is subclassed by<br>
zh_cn: 已被<br>作为子类

source: IsNotNull Check Methods
zh_cn: IsNotNull 检查方法

source: IsNull Check Methods
zh_cn: IsNull 检查方法

source: Issue
zh_cn: 问题

source: It cannot be moved to the interface
zh_cn: 不能移动到接口

source: It does not match anything in selected scope
zh_cn: 它不匹配所选范围内的任何内容

source: It is enough to point with your mouse cursor to a tab to be closed, and click the middle mouse button, or just use the Shift+click combination.
zh_cn: 只需鼠标光标指向要关闭的选项卡，点击鼠标中键，或使用 Shift+click 组合键。

source: It is enough to type the initial letters of the camel names in lower case, and they will be smartly recognized.
zh_cn: 只需输入驼峰名字的首字母小写就足够了，他们将被智能地识别。

source: It is especially useful when processing search results or compiler messages.
zh_cn: 在处理搜索结果或编译器消息时特别有用。

source: It is illegal to access static member ''{0}'' from enum constructor or instance initializer
zh_cn: 从枚举构造函数或实例初始化器访问静态成员 ''{0}'' 是非法的

source: It is not allowed to move a class into a non-static inner class
zh_cn: 不允许将类移动到非静态内部类

source: It is not allowed to move a class into itself
zh_cn: 不允许移动类到自身

source: It is possible to rename CSS selectors directly from HTML.
zh_cn: 可以直接从 HTML 重命名 CSS 选择器。

source: It is quite easy to toggle HTML5 outline view in the File Structure pop-up.
zh_cn: 在 File Structure 弹窗中切换 HTML5 大纲视图非常简单。

source: It is very easy to change the built-in web server port (File | Settings – Debugger – JavaScript), and use the "Built-in server port" spinner to set the new value.
zh_cn: 很容易更改内置的 web 服务器端口 (File | Settings – Debugger – JavaScript) ，然后使用 "Built-in server port" spinner 来设置新的值。

source: It is very easy to change the built-in web server port.
zh_cn: 很容易更改内置的 web 服务器端口。

source: It is very easy to copy and paste fragments of code between different files with &productName; because it automatically inserts necessary imports to the destination file to make the code compilable.
zh_cn: 使用 &productName; 在不同的文件中复制和粘贴的代码片段很容易，因为它会在目标文件中自动插入必要的导入来使代码可编译。

source: It is very easy to copy and paste fragments of code between different files with IntelliJ IDEA because it automatically inserts necessary imports to the destination file to make the code compilable.
zh_cn: 使用 IntelliJ IDEA 在不同的文件中复制和粘贴的代码片段很容易，因为它会在目标文件中自动插入必要的导入来使代码可编译。

source: It is very easy to toggle between find and replace functionality.
zh_cn: 很容易在查找和替换功能之间切换。

source: It shows the list of members of the current class.
zh_cn: 它显示当前类的成员列表。

source: It will also add the necessary punctuation.
zh_cn: 它还会添加必要的标点符号。

source: It will be created by {2}.
zh_cn: 它将由 {2} 创建。

source: It will be inserted before the boolean method or variable you were completing, thus negating the whole expression.
zh_cn: 感叹号将插入到你补全的布尔值的方法或变量之前，从而否定整个表达式。

source: It will conflict with the introduced parameter
zh_cn: 它将与引入的参数冲突

source: It will conflict with the new parameter.
zh_cn: 它将与新参数冲突。

source: It will conflict with the renamed parameter.
zh_cn: 它将与重命名的参数冲突。

source: It will conflict with the renamed {1}
zh_cn: 它将与重命名的 {1} 冲突

source: It would cause compilation problems with JDK {1}
zh_cn: 这将导致 JDK {1} 的编译问题

source: It''s the only usage in {0}
zh_cn: 在 {0} 中的唯一使用

source: It's easy to navigate between the actions and views in Rails applications.
zh_cn: 在 Rails 应用中很容易在 actions 和 views 中导航。

source: It's possible to use Preview tab in the Find in Path dialog box, for quicker search, without ever leaving the dialog box.
zh_cn: 可以在“在路径中查找”对话框中使用“预览”选项卡，以便更快速地进行搜索，而无需离开对话框。

source: It's quite easy to do - just right-click the button you want to hide, and on the context menu choose Remove from Sidebar .
zh_cn: 这是很容易做到的——只需右击想要隐藏的按钮，然后在上下文菜单中选择 Remove from Sidebar 。

source: It's very easy to navigate between the Django templates and referencing views.
zh_cn: 很容易在 Django 模板和参考视图间导航。

source: Italic
zh_cn: 斜体

source: Items generified: {0}, casts removed: {1}
zh_cn: 项目泛型化: {0}, 转换已移除: {1}

source: Items to be deleted
zh_cn: 要删除的项目

source: Iterate Iterable | Array in J2SDK 5.0 syntax
zh_cn: 用 J2SDK 5.0的语法迭代 Iterable | 数组

source: Iterate elements of array
zh_cn: 迭代数组元素

source: Iterate elements of array in reverse order
zh_cn: 以相反的顺序迭代数组的元素

source: Iterate elements of java.util.Collection
zh_cn: 迭代 java.util.Collection 的元素

source: Iterate elements of java.util.List
zh_cn: 迭代 java.util.List 的元素

source: Iterate elements of java.util.Vector
zh_cn: 迭代 java.util.Vector 的元素

source: Iterate java.util.Enumeration
zh_cn: 迭代 java.util.Enumeration

source: Iterate java.util.Iterator
zh_cn: 迭代 java.util.Iterator

source: Iterate over an Iterable or Array selection in J2SDK 5.0 syntax
zh_cn: 在 Iterable 或 数组上使用 J2SDK 5.0 的语法进行迭代

source: Iterate tokens from String
zh_cn: 迭代字符串中的字符

source: Iteration can be replaced with bulk ''{0}'' call
zh_cn: 迭代可以用 bulk(批量) ''{0}'' 调用替换

source: Its content may be overwritten.
zh_cn: 其内容可能会被覆盖。

source: J2ME issues
zh_cn: J2ME 问题

source: J2SDK 1.4.0 documented bugs may cause unstable debugger behavior.
zh_cn: J2SDK 1.4.0记录的错误可能会导致不稳定的调试器的行为。

source: JAR Files Diff
zh_cn: Jar 文件比较

source: JARs or directories...
zh_cn: JARs 或目录...

source: JDK ({0}) needed to run this ANT target is incorrectly configured.
zh_cn: 运行此 ANT 目标所需的 JDK({0})配置不正确。

source: JDK ({0}) needed to run this ANT target is not configured.
zh_cn: 未配置运行此 ANT 目标的 JDK({0})。

source: JDK ({0}) needed to run this Ant target is incorrectly configured.
zh_cn: 运行此 Ant 目标所需的 JDK({0})配置不正确。

source: JDK ({0}) needed to run this Ant target is not configured.
zh_cn: 未配置运行此 Ant 目标的 JDK({0})。

source: JDK also contains classes and runtime environment that are used to execute the target application.
zh_cn: JDK 还包含用于执行目标应用程序的类和运行时环境。

source: JDK definitions
zh_cn: JDK 定义

source: JDK is not specified
zh_cn: JDK 没有指定

source: JDK path
zh_cn: JDK 路径

source: JDK path is not specified Cannot generate JavaDoc
zh_cn: 没有指定 JDK 路径 无法生成 JavaDoc

source: JDK stands for the Java Development Kit, a software development package that is required to write, test and debug Java applications.
zh_cn: JDK 代表 Java 开发工具包，它是编写，测试和调试 Java 应用程序所需的软件开发包。

source: JPDA Libraries Missing
zh_cn: 缺少 JPDA 库

source: JS&P
zh_cn: JSP(&P)

source: JSF EL out of attribute #loc
zh_cn: JSF EL 在属性外 #loc

source: JSP Inspections
zh_cn: JSP 检查

source: JSP imports layout
zh_cn: JSP 导入布局

source: JSPx files
zh_cn: JSPx 文件

source: JShell snippet files
zh_cn: JShell 片断文件

source: JUnit Test
zh_cn: JUnit 测试

source: JUnit issues
zh_cn: JUnit 问题

source: JUnit not found in module ''{0}''
zh_cn: 在模块 ''{0}'' 中没有找到 JUnit

source: JUnit test configuration
zh_cn: JUnit 测试配置

source: JVM is currently suspended.
zh_cn: JVM 当前处于暂停状态。

source: JVM: {0} by {1}
zh_cn: JVM: {0} 由 {1} ————————————————————【汉化作者：平方X 汉化反馈：http://www.pingfangx.com】

source: Java Class
zh_cn: Java 类

source: Java Code Info
zh_cn: Java 代码信息

source: Java Compiler
zh_cn: Java 编译器

source: Java Debugger Frame View
zh_cn: Java 调试器框架视图

source: Java EE External Resources
zh_cn: Java EE 的外部资源

source: Java EE View Popup Menu
zh_cn: Java EE 视图弹出菜单

source: Java EE issues
zh_cn: Java EE 问题

source: Java Exception Breakpoints
zh_cn: java 异常断点

source: Java Field Watchpoints
zh_cn: java 字段观察点

source: Java Line Breakpoints
zh_cn: java 行断点

source: Java Method Breakpoints
zh_cn: java 方法断点

source: Java Module
zh_cn: Java 模块

source: Java Server Page files
zh_cn: Java 服务器页面文件

source: Java Type Renderers
zh_cn: Java 类型渲染器

source: Java application configuration
zh_cn: Java 应用程序配置

source: Java class files
zh_cn: Java 类文件

source: Java language level issues
zh_cn: Java 语言级问题

source: Java language level migration aids
zh_cn: Java 语言级迁移帮助

source: Java module naming conventions
zh_cn: Java 模块命名规范

source: Java modules are used for developing <b>JVM-based</b> desktop and web applications, including applications that use <b>Java EE</b> and other enterprise development frameworks.
zh_cn: Java 模块用于开发<b>基于 JVM</b> 的桌面和 Web 应用程序，包括使用 <b>Java EE</b> 和其他企业开发框架的应用程序。

source: Java source files
zh_cn: Java 源文件

source: JavaBeans issues
zh_cn: JavaBeans 问题

source: JavaDoc for abstracts
zh_cn: 抽象的 JavaDoc

source: JavaDoc output directory
zh_cn: JavaDoc 输出目录

source: JavaDoc paths cannot be converted.
zh_cn: JavaDoc 路径无法转换。

source: Javac Options
zh_cn: Javac 选项

source: Javac quirks
zh_cn: Javac 怪癖

source: Javadoc issues
zh_cn: Javadoc 问题

source: Javadoc pointing to itself
zh_cn: Javadoc 指向自身

source: Jdk ''{0}'' not configured
zh_cn: Jdk ''{0}'' 未配置

source: JetBrains Account authentication failed.
zh_cn: JetBrains 账户认证失败。

source: Join Declaration and Assignment
zh_cn: 连接声明和赋值

source: Join Lines
zh_cn: 连接行

source: Join declaration and assignment
zh_cn: 连接声明和赋值

source: Jump To Source
zh_cn: 跳转到源码

source: Jump To Type Source
zh_cn: 跳到类型源码

source: Jump to Colors and Fonts
zh_cn: 跳转到颜色和字体

source: Jump to Colors and Fonts option at caret
zh_cn: 跳转到插入符号处的颜色和字体选项

source: Jump to External Editor
zh_cn: 跳转到外部编辑器

source: Jump to Object Source
zh_cn: 跳转到对象源码

source: Just choose Run Python Console or Run Django Console in the Tools menu.
zh_cn: 只需在 Tools 菜单中选择 Run Python Console 或 Run Django Console 。

source: Just choose Tools | Open Terminal on the main menu, and enjoy using the embedded local terminal.
zh_cn: 只在主菜单选择 Tools | Open Terminal ，并尽情使用嵌入的本地终端。

source: Just click &shortcut:FileStructurePopup; once more, and the check box HTML5 outline becomes selected.
zh_cn: 只需再点一次 &shortcut:FileStructurePopup; ，复选框 HTML5 outline 将会选中。

source: Just click on highlighted source file name and line number in the console to see the source in the editor.
zh_cn: 只需在控制台中点击突出显示的源文件名和行号，即可在编辑器中查看源代码。

source: Just click the Terminal tool window button, and enjoy using the embedded local terminal.
zh_cn: 只需点击终端工具窗口按钮，并尽情使用嵌入的本地终端。

source: Just place the caret at the throws keyword in a method declaration, press &shortcut:HighlightUsagesInFile; and select the desired exception class from the list.
zh_cn: 只需将插入符号放到方法申明中的 throws 关键字，按 &shortcut:HighlightUsagesInFile; 然后从列表中选择期望的异常类。

source: Just press &shortcut:GotoAction; (Help | Find Action on the main menu) and start typing the name of the action.
zh_cn: 只需按 &shortcut:GotoAction; (在主菜单的 Help | Find Action ) ，然后开始输入操作的名字。

source: Just press &shortcut:QuickChangeScheme; (View | Quick Switch Scheme), to specify the scheme you want to change.
zh_cn: 只需按 &shortcut:QuickChangeScheme; (View | Quick Switch Scheme)来指定你想要更改的方案。

source: Just press &shortcut:$Copy; on any element in the lookup list.
zh_cn: 只需在查阅列表中的任何元素处按 &shortcut:$Copy; 。

source: Just press &shortcut:IntroduceVariable;, and choose the desired expression:
zh_cn: 只需按 &shortcut:IntroduceVariable;，然后选择所需的表达式：

source: Just right-click an annotation and use the Show Diff command in the context menu.
zh_cn: 只需右键单击注释并在上下文菜单中使用 Show Diff 命令。

source: Just start typing a regular expression, then press &shortcut:ShowIntentionActions; and choose Edit RegExp.
zh_cn: 只需开始输入一个正则表达式，然后按 &shortcut:ShowIntentionActions; 并选择 Edit RegExp。

source: Just type co to quickly find controller Rails generator.
zh_cn: 只需键入 co 即可快速找到 controller Rails生成器。

source: Just type mig to quickly find all migration tasks.
zh_cn: 只需键入 mig 即可快速查找所有迁移任务。

source: Just type some characters that, in your opinion, exist in the option description, and the list of settings will reduce to the matching ones.
zh_cn: 只需输入一些您认为存在于选项描述中的字符，然后设置列表将减少到匹配的项目。

source: Keep All
zh_cn: 保留全部

source: Keep Maximum Blank Lines
zh_cn: 保持最大的空行

source: Keep Whitespaces Inside
zh_cn: 保留内部的空格

source: Keep abstract
zh_cn: 保持抽象

source: Keep blank lines:
zh_cn: 保持空行:

source: Keep dependent methods together
zh_cn: 保持依赖方法在一起

source: Keep empty @param tags
zh_cn: 保持空 @param 标签

source: Keep empty @return tags
zh_cn: 保持空 @return 标签

source: Keep empty @throws tags
zh_cn: 保持空 @throws 标签

source: Keep empty lines
zh_cn: 保持空行

source: Keep getters and setters together
zh_cn: 保持 getter 和 setter 在一起

source: Keep hints window opened when the process is finished
zh_cn: 当进程完成时，保持提示窗口打开

source: Keep indents on empty lines
zh_cn: 保持空行缩进

source: Keep invalid tags
zh_cn: 保持无效标签

source: Keep line breaks
zh_cn: 保留换行符

source: Keep line breaks in text
zh_cn: 保留文本中的换行符

source: Keep local &history for (active working days)
zh_cn: 保持本地历史(活跃工作日)(&H)

source: Keep overridden methods together
zh_cn: 保持覆盖方法在一起

source: Keep the Ctrl key pressed, and the chevron buttons change to .
zh_cn: 按住 Ctrl 键， chevron 按钮更改为了 。

source: Keep when reformatting
zh_cn: 重新格式化时保持

source: Keep white spaces
zh_cn: 保持空白

source: Keep white spaces inside:
zh_cn: 保留内部的空格:

source: Keep your source code typo-free with the help of the built-in Spellchecker.
zh_cn: 在内置拼写检查器的帮助下，你可以保持源代码不含拼写错误。

source: Keeping Ctrl pressed, use the Up and Down arrow keys, Tab or Shift+Tab, Alt for navigation; use Delete or BackSpace to close editor tab or hide a tool window.
zh_cn: 按住 Ctrl 键，使用 Up 和 Down 方向键， Tab 或 Shift+Tab 及 Alt 来导航，使用 Delete 或 BackSpace 来关闭编辑器选项卡或隐藏工具窗口。

source: Key conflicts with existing one: ''{0}''
zh_cn: 与现有 key 冲突：''{0}''

source: Key maps
zh_cn: 键盘映射

source: Key pair
zh_cn: 密钥对

source: Keyboard Shortcut
zh_cn: 键盘快捷键

source: Keymap
zh_cn: 快捷键

source: Keymaps:
zh_cn: 快捷键:

source: Keystroke: "{0}"
zh_cn: 按键: "{0}"

source: Keyword
zh_cn: 关键字

source: Keyword cannot be empty
zh_cn: 关键字不能为空

source: Keyword may not contain spaces
zh_cn: 关键字中不能有空格

source: Keyword1
zh_cn: 关键字 1

source: Keyword2
zh_cn: 关键字 2

source: Keyword3
zh_cn: 关键字 3

source: Keyword4
zh_cn: 关键字 4

source: Keyword:
zh_cn: 关键字:

source: Keywords
zh_cn: 关键字

source: Kill Process
zh_cn: 杀死进程

source: Kill Selected Region
zh_cn: 删除选中区域

source: Kill process
zh_cn: 杀死进程

source: Kill the debug process immediately
zh_cn: 立即停止调试过程

source: Kill to Word End
zh_cn: 删除至词尾

source: Kill to Word Start
zh_cn: 删除至词首

source: LCD rendering
zh_cn: LCD 渲染

source: Label &name:
zh_cn: 标签名：(&N)

source: Label ''{0}'' already in use
zh_cn: 标签 ''{0}'' 已经在使用中

source: Label indent:
zh_cn: 标签缩进：

source: Label is already in use and will be replaced
zh_cn: 标签已经在使用，将被替换

source: Label without statement
zh_cn: 标签无语句

source: Lambda Body
zh_cn: Lambda 主体

source: Lambda arrow
zh_cn: Lambda 箭头

source: Lambda expressions
zh_cn: Lambda 表达式

source: Lambdas evaluation is not supported
zh_cn: 不支持 Lambdas 解析

source: Landscape
zh_cn: 横向

source: Language
zh_cn: 语言

source: Language Defaults
zh_cn: 语言默认值

source: Language Level Changed
zh_cn: 语言级别更改

source: Language level changes will take effect on project reload.
zh_cn: 语言级别更改将在项目重新加载时生效。

source: Language:
zh_cn: 语言:

source: Languages \& Frameworks
zh_cn: 语言 \& 框架

source: Languages:
zh_cn: 语言:

source: Last Edit L_ocation
zh_cn: 最后编辑位置(_O)

source: Last Week
zh_cn: 上周

source: Last checked
zh_cn: 最后检查

source: Last used
zh_cn: 上次使用

source: Last {0} Hours
zh_cn: 最后 {0} 小时

source: Later, this name will help you find the desired breakpoint:
zh_cn: 稍后，这个名字将帮助您找到所需的断点：

source: Later, when you browse through the changelists in the repository, such comments turn into hyperlinks:
zh_cn: 稍后，当您浏览存储库中的更改列表时，这些注释会变成超链接：

source: Layout
zh_cn: 布局

source: Layout configuration
zh_cn: 布局配置

source: Leading
zh_cn: 首位的
